In [1]:
import pandas as pd
import numpy as np
import pylab as py
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [4]:
median=df['test_score(out of 10)'].median()

In [5]:
df['test_score(out of 10)'].fillna(median,inplace=True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
df['experience'].fillna('zero',inplace=True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [7]:
from word2number import w2n
df['experience']=df['experience'].apply(w2n.word_to_num)

In [10]:
mask=np.random.rand(len(df))<0.8
train=df[mask]
test=df[~mask]

In [15]:
from sklearn import linear_model
multi_reg=linear_model.LinearRegression()
train_x = np.asanyarray(train[['experience','test_score(out of 10)','interview_score(out of 10)']])
train_y = np.asanyarray(train['salary($)'])
multi_reg.fit(train_x,train_y)
print('Coefficient:',multi_reg.coef_)
print('Interrcept:',multi_reg.intercept_)

Coefficient: [3103.07609282 2366.43281166 1841.60820291]
Interrcept: 15686.72423097679

In [22]:
from sklearn.metrics import r2_score
test_x = np.asanyarray(test[['experience','test_score(out of 10)','interview_score(out of 10)']])
test_y = np.asanyarray(test[['salary($)']])
pridicted = multi_reg.predict(test_x)

In [23]:
print("Mean absolute error: %.2f" % np.mean(np.absolute(pridicted - test_y)))
print("Residual sum of squares (MSE): %.2f" % np.mean((pridicted - test_y) ** 2))
print("R2-score: %.2f" % r2_score(pridicted , test_y) )

Mean absolute error: 9281.57
Residual sum of squares (MSE): 116248980.05
R2-score: 0.73